# Getting started with pandas

In [1]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)
%matplotlib inline

In [ ]:
%pwd

## Pandas 大门开启--数据结构

### Series

series属性.values .index  .name  .index.name

In [3]:
obj = Series([4, 7, -5, 3])
obj # Series 自带索引与array区别

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
arr=np.array([4, 7, -5, 3])
arr

array([ 4,  7, -5,  3])

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

series 保留numpy的数组运算功能（布尔值过滤，标量乘法，数学函数等）

In [9]:
obj2['a']

-5

In [8]:
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [11]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [12]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [13]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [14]:
'b' in obj2

True

In [15]:
'e' in obj2

False

可以通过字典直接生成Series

In [16]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3#按照原字典键的顺序排列

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [17]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4 #按index顺序匹配排序

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [18]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [ ]:
pd.notnull(obj4)

In [ ]:
obj4.isnull()

In [19]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [20]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [21]:
obj3 + obj4 #自动对齐数据，缺失值+数值=缺失值

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [22]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [ ]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

### DataFrame

1.创建 DataFrame（字典，columns=[],index=[]) 2.获取列 df.列名 or df['列名'] 3.获取行df.ix['索引行名']

In [10]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)
frame #创建 等长列表组成的字典

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [24]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [11]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [26]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [27]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [28]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [12]:
frame2.ix[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [13]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

添加一列 df['']=值/array/series /布尔判断

In [30]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [31]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [32]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [33]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [34]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [14]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
#外层字典作为列索引 内层为行索引

In [15]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [38]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [39]:
DataFrame(pop, index=[2001, 2002, 2003]) #内层字典键会被合并，但显示指定跟指定来

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [40]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [41]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [42]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [18]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [ ]:
frame2.values

### 索引对象

In [44]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [45]:
index[1:]

Index(['b', 'c'], dtype='object')

In [47]:
index[1] = 'd'  #index对象不能被修改

TypeError: Index does not support mutable operations

In [ ]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

In [ ]:
frame3

In [ ]:
'Ohio' in frame3.columns

In [ ]:
2003 in frame3.index

## 基本功能

### 重新索引 reindex ([],fill_value= or method='')

修改列索引reindex(columns=[])，利用df.ix([],[]) 行索引 列索引 更为简洁

In [20]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [21]:
obj.reindex(['a', 'b', 'c', 'd', 'e'])

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [22]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [49]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [50]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [51]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [52]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [53]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])obj.reindex(['a', 'b', 'c', 'd', 'e'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [54]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [55]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [56]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',
              columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [57]:
frame.ix[['a', 'b', 'c', 'd'], states] #ix重新索引

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### 丢弃指定轴上的项  drop

In [58]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c') #drop返回的是一个新对象
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [59]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [60]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [61]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [ ]:
data.drop(['Colorado', 'Ohio'])

In [ ]:
data.drop('two', axis=1)

In [ ]:
data.drop(['two', 'four'], axis=1)

### 索引 选取和过滤

[] 或者ix

In [62]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b']

1.0

In [63]:
obj[1]

1.0

In [64]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [71]:
obj[0:3]

a    0.0
b    1.0
c    2.0
dtype: float64

In [66]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [68]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [69]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [70]:
obj['b':'c']#标签切片运算包含末值，Python切片运算不包含

b    1.0
c    2.0
dtype: float64

In [72]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [73]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [74]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [75]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [76]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [77]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [78]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [ ]:
data[data < 5] = 0

In [ ]:
data

In [79]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [80]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [81]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [82]:
data.ix[:'Utah', 'two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [83]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

### 算术运算和数据对齐

In [84]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [85]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [86]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [87]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [ ]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

In [ ]:
df2

In [ ]:
df1 + df2

#### 在算术方法中填充值  add

In [88]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [89]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [90]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [91]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [ ]:
df1.reindex(columns=df2.columns, fill_value=0)

#### Operations between DataFrame and Series

In [2]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [3]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [4]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [5]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.ix[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [6]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [ ]:
frame - series

In [ ]:
series2 = Series(range(3), index=['b', 'e', 'f'])
frame + series2

In [ ]:
series3 = frame['d']
frame

In [ ]:
series3

In [ ]:
frame.sub(series3, axis=0)

### 函数应用和映射 df.apply(f)  f可以是pd.value_counts

In [69]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [8]:
frame

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

In [9]:
np.abs(frame)#基础的numpy用法应用于dataframe

               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189  1.296221

将函数应用到由各列或行所形成的一维数组上 apply

In [10]:
f = lambda x: x.max() - x.min()

In [11]:
frame.apply(f)

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [12]:
frame.apply(f, axis=1)

Utah      0.998382
Ohio      2.521511
Texas     0.676115
Oregon    2.542656
dtype: float64

In [13]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

In [70]:
frame.mean()

b    0.635713
d   -0.436259
e   -0.656905
dtype: float64

In [71]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah     3.25  -1.02  -0.58
Ohio     0.12   0.30   0.52
Texas    0.00   1.34  -0.71
Oregon  -0.83  -2.37  -1.86

** applymap() **

apply() 和applymap()是DataFrame数据类型的函数，map()是Series数据类型的函数。

apply()的操作对象DataFrame的一列或者一行数据， applymap()是element-wise的，作用于每个DataFrame的每个数据。 map()也是element-wise的，对Series中的每个数据调用一次函数。

In [72]:
frame['e'].map(format)

Utah      -0.58
Ohio       0.52
Texas     -0.71
Oregon    -1.86
Name: e, dtype: object

### 排序和排名 

sort_index() 索引排序  sort_values() 值排序 sort_values(by=)

In [73]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [74]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [75]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [76]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [78]:
obj = Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [82]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values(ascending=False) # 缺失值排序会放到末尾

2    7.0
0    4.0
5    2.0
4   -3.0
1    NaN
3    NaN
dtype: float64

In [83]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [85]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [86]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [23]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()#分配排名，同样则平均值

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [24]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [88]:
np.argsort(obj) # 从小到大的索引值

0    1
1    5
2    4
3    3
4    6
5    0
6    2
dtype: int64

In [90]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [ ]:
obj.rank(ascending=False, method='max')

In [93]:
obj.rank(method='max') #method 默认为average 还有min  max  first

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [25]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [27]:
frame.rank(method='first')

     a    b    c
0  1.0  3.0  2.0
1  3.0  4.0  3.0
2  2.0  1.0  4.0
3  4.0  2.0  1.0

In [92]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

### 带有重复值的轴索引

In [94]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [ ]:
obj.index.is_unique

In [ ]:
obj['a']

In [ ]:
obj['c']

In [ ]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

In [ ]:
df.ix['b']

## 汇总和计算描述统计

In [95]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [96]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [98]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [97]:
df.mean(axis=1, skipna=False) #默认NA值自动排除 skipna=false 禁止用该功能

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [99]:
df.idxmax()# series和dataframe 都可以返回最大值索引

one    b
two    d
dtype: object

In [101]:
obj.argmax()#argmax 仅可用于series返回最大值索引

'c'

In [102]:
obj.idxmax()

'c'

In [ ]:
df.cumsum()

In [ ]:
df.describe()

In [ ]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

### 相关系数与协方差 corr  cov

In [104]:
import pandas.io.data as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker,'1/1/2015','1/1/2016')

price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.items()})

In [105]:
returns = price.pct_change()# 百分数变化
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2015-12-24 -0.005340 -0.002546 -0.002093 -0.002687
2015-12-28 -0.011201  0.018854 -0.004629  0.005030
2015-12-29  0.017974  0.018478  0.015769  0.010724
2015-12-30 -0.013059 -0.007211 -0.003148 -0.004244
2015-12-31 -0.019195 -0.015720 -0.012344 -0.014740

In [106]:
returns.MSFT.corr(returns.IBM) #corr 相关系数

0.54925485472192781

In [107]:
returns.MSFT.cov(returns.IBM)

0.0001304752054304064

In [108]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.379946  0.516671  0.523573
GOOG  0.379946  1.000000  0.451687  0.520562
IBM   0.516671  0.451687  1.000000  0.549255
MSFT  0.523573  0.520562  0.549255  1.000000

In [109]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000284  0.000119  0.000116  0.000157
GOOG  0.000119  0.000347  0.000112  0.000173
IBM   0.000116  0.000112  0.000178  0.000130
MSFT  0.000157  0.000173  0.000130  0.000317

In [ ]:
returns.corrwith(returns.IBM)

In [ ]:
returns.corrwith(volume)

### Unique values, 值计数 value_counts  , and membership

In [110]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [ ]:
uniques = obj.unique()
uniques

In [111]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [112]:
pd.value_counts(obj.values, sort=False)

d    1
c    3
b    2
a    3
dtype: int64

In [ ]:
mask = obj.isin(['b', 'c'])
mask

In [ ]:
obj[mask]

In [113]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [114]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## 处理缺失值

In [115]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [ ]:
string_data.isnull()

In [116]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### 滤出缺失数据

In [118]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
data[data.notnull()]

In [119]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna() #默认丢弃行 
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [120]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [121]:
data.dropna(how='all')#丢弃全部为NA的行

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [122]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [123]:
data.ix[4]=NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN
4  NaN  NaN  NaN NaN

In [124]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0
4  NaN  NaN  NaN

In [127]:
df = DataFrame(np.random.randn(7, 3))
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA
df

          0         1         2
0 -0.919262       NaN       NaN
1  0.758363       NaN       NaN
2 -0.010032       NaN       NaN
3  0.852965       NaN -0.023493
4 -2.304234       NaN -1.218302
5 -1.332610  1.074623  0.723642
6  0.690002  1.001543 -0.503087

In [131]:
df.dropna(thresh=3)#会在一行中至少有 3 个非 NA 值时将其保留

          0         1         2
5 -1.332610  1.074623  0.723642
6  0.690002  1.001543 -0.503087

### 填充缺失值

In [ ]:
df.fillna(0)

In [132]:
df.fillna({1: 0.5, 3: -1}) # fillna 调用字典不同列填充不同值

          0         1         2
0 -0.919262  0.500000       NaN
1  0.758363  0.500000       NaN
2 -0.010032  0.500000       NaN
3  0.852965  0.500000 -0.023493
4 -2.304234  0.500000 -1.218302
5 -1.332610  1.074623  0.723642
6  0.690002  1.001543 -0.503087

In [133]:
# always returns a reference to the filled object
_ = df.fillna(0, inplace=True)
df #inplace = True 对现有对象进行修改

          0         1         2
0 -0.919262  0.000000  0.000000
1  0.758363  0.000000  0.000000
2 -0.010032  0.000000  0.000000
3  0.852965  0.000000 -0.023493
4 -2.304234  0.000000 -1.218302
5 -1.332610  1.074623  0.723642
6  0.690002  1.001543 -0.503087

In [ ]:
df = DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA
df

In [ ]:
df.fillna(method='ffill')

In [ ]:
df.fillna(method='ffill', limit=2)

In [ ]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

## 层次化索引

In [50]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    0.274992
   2    0.228913
   3    1.352917
b  1    0.886429
   2   -2.001637
   3   -0.371843
c  1    1.669025
   2   -0.438570
d  2   -0.539741
   3    0.476985
dtype: float64

In [51]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [52]:
data['b']

1    0.886429
2   -2.001637
3   -0.371843
dtype: float64

In [53]:
data['b':'c']

b  1    0.886429
   2   -2.001637
   3   -0.371843
c  1    1.669025
   2   -0.438570
dtype: float64

In [54]:
data.ix[['b', 'd']]#data.ix 可间隔取多个行

b  1    0.886429
   2   -2.001637
   3   -0.371843
d  2   -0.539741
   3    0.476985
dtype: float64

In [55]:
data[:, 2]#内层选取

a    0.228913
b   -2.001637
c   -0.438570
d   -0.539741
dtype: float64

In [56]:
data

a  1    0.274992
   2    0.228913
   3    1.352917
b  1    0.886429
   2   -2.001637
   3   -0.371843
c  1    1.669025
   2   -0.438570
d  2   -0.539741
   3    0.476985
dtype: float64

In [57]:
data.unstack()

          1         2         3
a  0.274992  0.228913  1.352917
b  0.886429 -2.001637 -0.371843
c  1.669025 -0.438570       NaN
d       NaN -0.539741  0.476985

In [ ]:
data.unstack().stack()

In [58]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [59]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [60]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

### 重排分级顺序 waplevel

In [61]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [62]:
frame.sortlevel(1)#对级别中的值进行排序 （稳定的）

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [63]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [64]:
frame.swaplevel(0, 1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [65]:
frame.swaplevel(0, 1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

### 根据级别汇总统计

In [66]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [67]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame's columns

字典中key为dataframe的列索引，set_index 列索引转为行索引  reset_index 取消层次化索引

In [46]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [47]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [48]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [49]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Other pandas topics

### 整数索引在切片有bug,  irow没弄明白

series 可使用iget_value dataframe 使用irow 列  ,icol 行

In [20]:
ser = Series(np.arange(3.))
ser.iloc[-1] #索引为整数 ser[-1] 会报错

2.0

In [34]:
ser2[:1]

a    0.0
dtype: float64

In [23]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [29]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [35]:
ser2.ix[:1]

a    0.0
dtype: float64

In [36]:
ser.ix[:1]

0    0.0
1    1.0
dtype: float64

In [37]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3.iloc[2]

2

In [42]:
frame = DataFrame(np.arange(6).reshape((3, 2)))
frame.iloc[0]

0    0
1    1
Name: 0, dtype: int32

In [43]:
frame

   0  1
0  0  1
1  2  3
2  4  5

In [45]:
frame.irow[0:0]

TypeError: 'method' object is not subscriptable

### 面板数据 多维数据

In [14]:
import pandas.io.data as web

pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk))
                       for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

C:\Anaconda3\lib\site-packages\pandas\io\data.py:35: FutureWarning:
The pandas.io.data module is moved to a separate package (pandas-datareader) and will be removed from pandas in a future version.
After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.
  FutureWarning)

In [15]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1758 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2016-11-25 00:00:00
Minor_axis axis: Open to Adj Close

In [16]:
pdata = pdata.swapaxes('items', 'minor')
pdata['Adj Close'].info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1758 entries, 2010-01-04 to 2016-11-25
Data columns (total 4 columns):
AAPL    1738 non-null float64
DELL    983 non-null float64
GOOG    1738 non-null float64
MSFT    1738 non-null float64
dtypes: float64(4)
memory usage: 68.7 KB

In [17]:
pdata.ix[:, '6/1/2012', :]

            Open        High         Low       Close       Volume   Adj Close
AAPL  569.159996  572.650009  560.520012  560.989983  130246900.0   72.996726
DELL   12.150000   12.300000   12.045000   12.070000   19397600.0   11.675920
GOOG  571.790972  572.650996  568.350996  570.981000    6138700.0  285.205295
MSFT   28.760000   28.959999   28.440001   28.450001   56634300.0   25.093451

In [ ]:
pdata.ix['Adj Close', '5/22/2012':, :]

In [18]:
stacked = pdata.ix[:, '5/30/2012':'6/30/2012', :].to_frame() # series to dataframe 
stacked

                        Open        High         Low       Close       Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400.0
           DELL    12.590000   12.700000   12.460000   12.560000   19787800.0
           GOOG   588.161028  591.901014  583.530999  588.230992    3827600.0
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500.0
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600.0
           DELL    12.530000   12.540000   12.330000   12.330000   19955600.0
           GOOG   588.720982  590.001032  579.001013  580.860990    5958800.0
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000.0
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900.0
           DELL    12.150000   12.300000   12.045000   12.070000   19397600.0
           GOOG   571.790972  572.650996  568.350996  570.981000    6138700.0
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300.0
2012-06-04 AAPL   561.500008  567.499985  548.499977  564.289978  139248900.0
           DELL    12.110000   12.112500   11.800000   12.000000   17015700.0
           GOOG   570.220958  580.491016  570.011006  578.590973    4883500.0
           MSFT    28.620001   28.780001   28.320000   28.549999   47926300.0
2012-06-05 AAPL   561.269989  566.470001  558.330002  562.830025   97053600.0
           DELL    11.950000   12.240000   11.950000   12.160000   15620900.0
           GOOG   575.451008  578.131003  566.470986  570.410999    4697200.0
           MSFT    28.510000   28.750000   28.389999   28.510000   45715400.0
2012-06-06 AAPL   567.770004  573.849983  565.499992  571.460022  100363900.0
           DELL    12.210000   12.280000   12.090000   12.215000   20779900.0
           GOOG   576.480979  581.970971  573.611004  580.570966    4207200.0
           MSFT    28.879999   29.370001   28.809999   29.350000   46860500.0
2012-06-07 AAPL   577.290009  577.320023  570.500000  571.720001   94941700.0
           DELL    12.320000   12.410000   12.120000   12.130000   20074000.0
           GOOG   587.601014  587.891038  577.251006  578.230986    3530100.0
           MSFT    29.639999   29.700001   29.170000   29.230000   37792800.0
2012-06-08 AAPL   571.599998  580.580017  568.999992  580.319984   86879100.0
           DELL    12.130000   12.225000   12.020000   12.120000   18155600.0
...                      ...         ...         ...         ...          ...
2012-06-20 GOOG   579.810985  580.000965  573.510959  577.511011    4710800.0
           MSFT    30.930000   31.049999   30.639999   30.930000   36257100.0
2012-06-21 AAPL   585.439995  588.219978  577.440025  577.669991   81587800.0
           DELL    12.270000   12.300000   11.960000   12.000000   21904200.0
           GOOG   579.841005  579.841005  563.730952  565.210969    4037600.0
           MSFT    30.959999   31.139999   30.059999   30.139999   48456600.0
2012-06-22 AAPL   579.040009  582.189987  575.420006  582.099998   71117900.0
           DELL    12.010000   12.230000   12.010000   12.200000   37018100.0
           GOOG   568.000995  571.480976  565.820975  571.480976    4472400.0
           MSFT    30.299999   30.730000   30.030001   30.700001   45098100.0
2012-06-25 AAPL   577.299995  579.800026  570.370010  570.770020   76095600.0
           DELL    12.090000   12.100000   11.850000   11.945000   21144300.0
           GOOG   567.330950  568.090991  557.350977  560.700956    3174900.0
           MSFT    30.299999   30.320000   29.620001   29.870001   42217200.0
2012-06-26 AAPL   571.329979  574.489998  567.329994  572.030022   69134100.0
           DELL    11.970000   12.060000   11.750000   11.925000   22628900.0
           GOOG   562.760959  566.600989  559.480944  564.680974    2710500.0
           MSFT    30.000000   30.270000   29.940001   30.020000   38421300.0
2012-06-27 AAPL   575.000023  576.739983  571.920006  574.499985   50749300.0
           DELL    11.960000   12.360000   11.950000   12.330000   23345900.0
           GOOG   567.700985  573.990963  566.020941  569.300956    3397200.0
           MSFT    30.190001   30.500000   30.030001   30.170000   33781700.0
2012-06-28 AAPL   571.670013  574.000000  565.610008  569.049980   70709100.0
           DELL    12.180000   12.190000   11.760000   11.950000   21747400.0
           GOOG   565.900986  566.230954  557.210927  564.310939    3856100.0
           MSFT    29.980000   30.049999   29.420000   29.910000   45328400.0
2012-06-29 AAPL   577.999985  584.000015  574.249992  584.000015  105375200.0
           DELL    12.180000   12.600000   12.150000   12.510000   20735600.0
           GOOG   574.960957  580.130967  572.201012  580.070990    5057800.0
           MSFT    30.450001   30.690001   30.139999   30.590000   55227200.0

                   Adj Close
Date       minor
2012-05-30 AAPL    75.362333
           DELL    12.149920
           GOOG   293.821674
           MSFT    25.878448
2012-05-31 AAPL    75.174961
           DELL    11.927430
           GOOG   290.140354
           MSFT    25.746145
2012-06-01 AAPL    72.996726
           DELL    11.675920
           GOOG   285.205295
           MSFT    25.093451
2012-06-04 AAPL    73.426126
           DELL    11.608210
           GOOG   289.006480
           MSFT    25.181652
2012-06-05 AAPL    73.236155
           DELL    11.762980
           GOOG   284.920579
           MSFT    25.146372
2012-06-06 AAPL    74.359101
           DELL    11.816190
           GOOG   289.995487
           MSFT    25.887268
2012-06-07 AAPL    74.392930
           DELL    11.733960
           GOOG   288.826666
           MSFT    25.781425
2012-06-08 AAPL    75.511971
           DELL    11.724290
...                      ...
2012-06-20 GOOG   288.467038
           MSFT    27.280858
2012-06-21 AAPL    75.167150
           DELL    11.608210
           GOOG   282.323161
           MSFT    26.584062
2012-06-22 AAPL    75.743588
           DELL    11.801680
           GOOG   285.455033
           MSFT    27.077994
2012-06-25 AAPL    74.269317
           DELL    11.555000
           GOOG   280.070407
           MSFT    26.345918
2012-06-26 AAPL    74.433270
           DELL    11.535650
           GOOG   282.058429
           MSFT    26.478221
2012-06-27 AAPL    74.754665
           DELL    11.927430
           GOOG   284.366112
           MSFT    26.610524
2012-06-28 AAPL    74.045503
           DELL    11.559840
           GOOG   281.873596
           MSFT    26.381198
2012-06-29 AAPL    75.990821
           DELL    12.101550
           GOOG   289.745749
           MSFT    26.980972

[92 rows x 6 columns]

In [19]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 23 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2012-06-29 00:00:00
Minor_axis axis: AAPL to MSFT